
import React from 'react';

const InstructionsPage: React.FC = () => {
  return (
    <div>
      <h1 className="text-3xl font-bold text-gray-800 mb-6">التعليمات</h1>
      <div className="bg-white p-8 rounded-xl shadow-lg">
        <div className="text-gray-700 space-y-4">
          <p className="font-semibold">
            عزيزي الطالب تم تطوير بيئة التعلم التكيفية التشاركية بهدف تنمية بعض مهارات تطوير المكتبات الافتراضية ثلاثية الأبعاد.
          </p>
          <ol className="list-decimal list-inside space-y-3 bg-gray-50 p-6 rounded-md">
            <li>عليك أن تجيب عن الاختبار القبلي المتاح داخل بيئة التعلم قبل دراسة الموديولات ثم بعد ذلك تنتقل لدراسة الموديولات بالترتيب.</li>
            <li>اقرأ عنوان كل موديل وأهدافه قراءة جيدة.</li>
            <li>إبدا بدراسة كل مودود وفقاً لترتيب الموضوعات.</li>
            <li>أجب عن الأسئلة الموجودة داخل كل موضوع لتحصل على درجه لكل سؤال.</li>
            <li>قم بحل النشاط الموجود نهاية كل موضوع.</li>
            <li>يمكنك التواصل مع أفراد مجموعتك والإرسال لمعلمك من خلال أدوات التفاعل المتاحة داخل البيئة.</li>
            <li>قم بالإجابة عن أسئلة الاختبار البعدي للموديول لتتمكن من الانتقال للموديول التالي.</li>
            <li>بعد انتهائك عزيزي الطالب من دراسة جميع الموديولات قم بالإجابة عن الاختبار البعدي الكلي لبيئة التعلم.</li>
            <li>مدة دراسة الموديولات (30) يوم يجب الالتزام بالخطة الزمنية المحددة للانتهاء من دراسة المحتوى.</li>
          </ol>
        </div>
      </div>
    </div>
  );
};

export default InstructionsPage;